hund = {0: '', 1: 'сто', 2: 'двести', 3: 'триста', 4: 'четыреста', 5: 'пятьсот', 6:
'шестьсот', 7: 'семьсот', 8: 'восемьсот', 9: 'девятьсот'}

def number_to_words(n):
    dig = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    dec = ['',  'десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят',
           'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    hund = {0: '', 1: 'сто', 2: 'двести', 3: 'триста', 4: 'четыреста', 5: 'пятьсот', 6:
        'шестьсот', 7: 'семьсот', 8: 'восемьсот', 9: 'девятьсот'}

    x = ''
    if n == 0:
        return 'ноль'
    if n < 100:
        d = dec[n % 100 // 10]
        x += d + (d and ' ' or '') + dig[n % 10]
    else:
        h = hund[n % 1000 // 100]
        d = dec[n % 100 // 10]
        x += h + (h and ' ' or '') + d + (d and ' ' or '') + dig[n % 10]
    return x.strip()


if __name__ == '__main__':
    numb = input("Ввведите число до 999:")
    x = number_to_words(int(numb))
    print(x)